<?php
require 'fpdf.php';
$pdf = new FPDF ();
$pdf->AddPage ();
$pdf->Image ( '123.jpg', 30, 20, 0, 0, '', 'http://www.select2web.com' );
// รูปแบบการใช้คำสั่ง image
// Image($file, $x=null, $y=null, $w=0, $h=0, $type='', $link='')
// Image = เป็นคำสั่งในการเพิ่มรูปลงใน PDF ที่เราสร้าง
// $file=(บังคับ) พาธของภาพที่ต้องการใส่เข้าไปในไฟล์ PDF
// $x= (ออฟชั่น) ตำแหน่งวางภาพในแกนแนวนอน โดยวัดจากขอบด้านซ้าย ระบุเป็นตัวเลข ถ้าไม่ระบุตัว FPDF จะยึดเอาตำแหน่งเคอเซ่อแนวนอนปัจุบันมาใช้งาน
// $y= (ออฟชั่น) ตำแหน่งวางภาพในแกนแนวตั้ง โดยวัดจากขอบด้านบน ระบุเป็นตัวเลข ถ้าไม่ระบุตัว FPDF จะยึดเอาตำแหน่งเคอเซ่อแนวนอนปัจุบันมาใช้งาน
// $w= (ออฟชั่น) ความกว้างของภาพที่จะให้วาดลงไปในไฟล์ pdf ถ้าไม่ระบุตัว FPDF จะคำณวนให้เองอัตโนมัติ โดยมันจะคำณวนจากภาพต้นฉบับและให้พอกับขนาดความกว้างของหน้า
// $h= (ออฟชั่น) ความสูงของภาพที่จะให้วาดลงไปในไฟล์ pdf ถ้าไม่ระบุตัว FPDF จะคำณวนให้เองอัตโนมัติ โดยมันจะคำณวนจากภาพต้นฉบับและให้พอกับขนาดความกว้างของหน้า
// $type= ชนิดของภาพ JPG,JPEG,PNG และ GIF ถ้าไม่ระบุ FPDF จะยึดเอาจากนามสกุลของภาพจากพารามิเตอร์ File
// $link= ป้อน URL ของเว็บไซต์ในกรณีต้องการให้คลิกที่ภาพแล้วเปิดหน้าเว็บ
$pdf->Output ();
?>