<?php
define('FPDF_FONTPAT', 'font/');
require 'fpdf.php';
$pdf=new FPDF();
$pdf->AddFont('angsana','','angsa.php');
$pdf->AddPage();
$pdf->SetFont('angsana','',14);
$pdf->MultiCell(20, 5, iconv('UTF-8', 'cp874', 'นี้คือข้อความที่ตั้งใจให้ยาวเลยความกว้างของกรอบเซลล์'));
$pdf->Output();
//MultiCell($w, $h, $txt, $border=0, $align='J', $fill=false)
// 50 = w : (ตัวเลข) ความกวัางของกล่องข้อความ ถ้าระบบเป็น 0 กล้องจะกว่างไปจนถึงกั้นขวาของกระดาษ
// 5 = h : (ตัวเลข) ความสูงของกล่องข้อความ ค่าดีฟอลต์เป็น 0
// $txt = ช้อความที่จะพิมพ์
//		    จากตัวอย่าง  ใช้คำสั่ง iconv เป็นคำสั่ง เรียกคำสั่ง มาตรฐาน ของภาษา UTF-8
// $border = เส้นขอบ  ค่าของมันคือ 0= ไม่มีขอบ     และ   1= มีขอบ
// 			และยังสามารถระบุได้ว่าจะตีเส้นด้านไหนของกรอบได้ด้วย
//			L= ขอบด้านซ้าย
//			T= ขอบด้านบน
//			R= ขอบด้านขวา
//			B= ขอบล่าง
//			'TBR'  หมายความว่า  ตีเส้น ด้าบน  และ  ด้านล่าง และ  ด้านขวา          !!! แต่ไม่ตีเส้นด้านหน้า
// $align = (ตัวหนังสือ) จัดเรียงข้อความภายในกล่อง
//			L or ค่าว่าง = ชิดซ้าย (Default Value)
//			C = จัดกึ่งกลาง
//			R = ชิดขวา
// $fill = (true/false) แรเงากล่องข้อความหรือไม่  สำหรับสีที่จะใช้ในการแรเงานั้นกำหนดได้ด้วยคำสั่ง SetFillColor ซึ่งจะอธิบายในบทต่อ ๆ ไป
//			false : ไม่มีแรเงา (default)
//			ture : แรเงา
?>