<?php
require 'fpdf.php'; // include file fpdf เข้า
$pdf = new FPDF ( 'P', 'mm', array (100,200 ) );
// $pdf = new FPDF ( 'P', 'mm', 'A4' );

// สร้าง instant FPDF
// ('P','mm',array(100,200))
// 'p' = Orientation : กำหนดกระดาษแนวตั้งหรือแนวนอน ค่าที่เป็นได้คือ
// p= แนวตั้ง(Default)
// L= แนวนอน
// 'mm' = Unit : หน่วยวัด ใช้เป็นหน่วยในการกำหนดพิกัดพิมพ์ข้อความลงบน pdf
// pt= point 1 pt เท่ากับ 1/72 นิ้ว, หรือประมาณ 0.35 มม.
// mm= มิลลิเมตร(Default)
// cm= เซนติเมตร
// in= นิ้ว
// array(100,200)= Format : ขนาดกระดาษ
// ค่าที่เป็นไปได้คือ= A3,A4(Default),A5,Letter,array(width,height)= กำหนดเองโดยส่งอะเรย์ กว้าง x ยาว หน่วยตามกำหนดใน Unit

$pdf->AddPage (); //เพิ่มหน้ากระดาษ
$pdf->SetFont ( 'Arial', 'B', 16 );  //กำหนด ฟ้อนที่จะใช้ ซึ่ง ณ ตอนนี้จะใช้ได้เฉพาะฟอนต์ Arial เท้าน้้น
$pdf->Text ( 10, 10, 'Hello World!' );

// พิมพ์ข้อความลงในเอกสาร
// เยื้องจากขอบกระดาษด้านซ้าย 10 มม.
// เยื้องจากขอบกระดาษด้านบน 10 มม.
// พิมพ์คำว่า Hello World! ลงในตำแหน่ง

$pdf->Output (); //output
?>