<?php
	//FPDF บทที่ 2 การใช้งานเบื้องต้น
	// อ้างอิง  http://www.select2web.com/fpdf/fpdf-lesson-2.html

	include 'fpdf.php'; //1.include ไฟล์ fpdf.php เข้ามา
	$pdf = new FPDF(); //2.สร้าง instant FPDF
	$pdf->AddPage(); //3. เพิ่มหน้ากระดาษ
	$pdf->SetFont('Arial', 'B', 16); //4. กำหนดฟ้อนต์ที่จะใช้ ซึ่ง ณ ตอนนี้จะใช้ได้เฉพาะฟอนต์ Arial เท่านั้น
	//กำหนดฟอนต์ Arial ตัวหนา ขนาด 16
	$pdf->Text(10, 10, 'Hello World!'); //5. พิมพ์ข้อความลงไปในเอกสาร
	//พิมพ์คำว่า Hello World! ลงไปในตำแหน่ง
	//เยื้องจากขอบกระดาษด้านซ้าย 10 มม.
	//เยื้องจากขอบกระดาษด้านบน 10 มม.
	$pdf->Output(); //6. Output

	//ท่านต้องท่องไว้ในใจเลยว่า อย่างต่ำ จะต้องมี 6 ขั้นตอนนี้เสมอ
?>